Revit 2027 API
BalusterInfo.TopOffset Property
 The offset from the top reference.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double TopOffset { get; set; }
Public Property TopOffset As Double
	Get
	Set
public:
property double TopOffset {
	double get ();
	void set (double value);
}
member TopOffset : float with get, set
Property Value
Double
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: The given value for topOffset must be no more than 30000 feet in absolute value.
See Also
Reference
BalusterInfo Class
Autodesk.Revit.DB.Architecture Namespace